import React from "react";
import classNames from "classnames/bind";
import styles from "./mnr.module.scss";

const cx = classNames.bind(styles);

const MNR: React.FC = () => {
  return (
    <div className={cx('container')}>
      <h4 className={cx('headline')}>Машина з натуральнозначними регістрами</h4>
      <p>Машина з натуральнозначними регістрами (МНР) — абстрактна обчислювальна машина. Машина з натуральнозначними регiстрами (МНР) є iдеалiзованою моделлю комп'ютера. МНР складається із, взагалі кажучи,
         нескінченної кількості натуральночисельних регістрів, пронумерованих з нуля. Позначатимемо їх R[0], R[1], …, R[n], … </p>
      <p>Послiдовнiсть ('R<sub>0</sub>, 'R<sub>1</sub>,..., 'R<sub>n</sub>, ...) вмiстiв регiстрiв МНР називатимемо <i>конфiгурацiєю</i> МНР.</p>
      <p>Команди для МНР бувають чотирьох видів:</p>
      <ol>
        <li>Обнулити регістр з номером n Z(n): 'R<sub>n</sub> &#8788; 0</li>
        <li>Збільшення на одиницю(інкремент) n-ого регістра S(n): 'R<sub>n</sub> &#8788; 'R<sub>n</sub>+1</li>
        <li>Копіювати вміст регістру m в n T(m, n): 'R<sub>n</sub> &#8788; 'R<sub>m</sub></li>
        <li>Якщо R[m]=R[n], то наступною виконувати команду з номером q, інакше — наступну за списком(умовний перехід)</li>
      </ol>
      <p>Формальними моделями алгоритмів є саме МНР-програми, поняття МНР використовується для опису функціонування МНР-програм.
         Виконання програми МНР починає, перебуваючи в деякiй початковiй конфiгурацiї, з виконання першої за списком команди. Наступна для виконання команда програми визначається так, як описано вище.
         Виконання програми завершується (програма зупиняється), якщо наступна для виконання команда вiдсутня (тобто номер наступної команди перевищує номер останньої команди програми). </p>
      <p><i>Конкатенацією</i> стандартних МНР-програм P = І<sub>1</sub>I<sub>2</sub>...I<sub>k</sub> та Q = І<sub>1</sub>I<sub>2</sub>...I<sub>m</sub> назвемо стандартну МНР-програму I<sub>1</sub>...I<sub>k</sub>I<sub>k+1</sub>...I<sub>k+m</sub>,
         де команди I<sub>k+1</sub>,..., I<sub>k+m</sub> по суті є командами програми Q, у яких кожна команда вигляду J(m, n, q) замінена командою J(m, n, q + k). </p>
      <p>МНР-програми P та Q <i>еквiвалентнi</i>, якщо при роботi над однаковими початковими конфiгурацiями вони або обидві зупиняються з однаковими фiнальними конфiгурацiями, або обидвi не зупиняються.</p>
      <h4><b>Приклад. МНР-програма для функції <i>f(x,y) = x+y</i></b></h4>
      <p>Необхідні команди для обробки даної функції:</p>
      <ol>
        <li>J(1,2,5)</li>
        <li>S(0)</li>
        <li>S(2)</li>
        <li>J(0,0,1)</li>
      </ol>
      <p>Продемонструємо роботу програми на конкретному прикладі <i>f(2,3) = 2+3</i></p>
      <table>
        <tbody>
          <tr>
            <td>R<sub>0</sub></td>
            <td>R<sub>1</sub></td>
            <td>R<sub>2</sub></td>
            <td>R<sub>3</sub></td>
          </tr>
          <tr>
            <td>2</td>
            <td>3</td>
            <td>0</td>
            <td>0</td>
          </tr>
          <tr>
            <td>3</td>
            <td>3</td>
            <td>0</td>
            <td>0</td>
          </tr>
          <tr>
            <td>3</td>
            <td>3</td>
            <td>1</td>
            <td>0</td>
          </tr>
          <tr>
            <td>4</td>
            <td>3</td>
            <td>1</td>
            <td>0</td>
          </tr>
          <tr>
            <td>4</td>
            <td>3</td>
            <td>2</td>
            <td>0</td>
          </tr>
          <tr>
            <td>5</td>
            <td>3</td>
            <td>2</td>
            <td>0</td>
          </tr>
          <tr>
            <td className={cx('underline')}>5</td>
            <td>3</td>
            <td>3</td>
            <td>0</td>
          </tr>
        </tbody>
      </table>
      <p>Результат в клітинці R<sub>0</sub>, що відповідає 2+3=5</p>
      <div className={cx('button')}>
        <a href="https://illia1810.github.io/MNR/" target="_blank" rel="noreferrer" className={cx('button__text')}>Демонстрація роботи МНР програми</a>
      </div>
    </div>
  );
};

export default MNR;
