import React from "react";
import classNames from "classnames/bind";
import styles from "./machineTuring.module.scss";

const cx = classNames.bind(styles);

const MachineTuring: React.FC = () => {
  return (
    <div className={cx('container')}>
      <h4 className={cx('headline')}>Машини Тюрінга</h4>
      <p>Машина Тюрінга – це гіпотетична модель обчислень, запропонована Аланом М. Тюрінгом у 1936 році. Її ціль – надати формальне визначення інтуїтивному поняттю «може бути обчислено».</p>
      <p>Пiд машиною Тюрiнга розуміємо впорядковану 5-ку (Q, T, 	&#948;, q<sub>0</sub>, q*), де:</p>
      <ul>
        <li>Q – скінченна множина станів;</li>
        <li>T – скінченний алфавіт символів;</li>
        <li>&#948; – однозначна функція переходів (&#948;: (𝑄 × T) → (T × &#123;𝐿,𝑅&#125; × 𝑄));</li>
        <li>q<sub>0</sub> – початковий стан;</li>
        <li>q* - фінальний стан.</li>
      </ul>
      <p>Машина Тюрінга детермінована, якщо функція &#948; однозначна, інакше МТ недетермінована.</p>
      <p>Функція переходу для машини Тюрінга це функція від обчислюваних станів на множину обчислюваних станів. Наприклад, якщо 𝛿: 𝑞𝑖 , 𝑆𝑖 = 
      &#40; 𝑆𝑖,𝑗 ,&#123;𝐿, 𝑅, 𝑁&#125;, 𝑞𝑖,𝑗&#41;, то коли стан Машини Тюрінга = 𝑞𝑖 і на вході число 𝑆𝑖, машина Т змінює 𝑆𝑖 на новий символ 𝑆𝑖,𝑗 та рухається у напрямку L/R/N, та переходить у новий стан 𝑞𝑖,𝑗</p>
      <p>Конфiгурацiя, або повний стан МТ – це слово вигляду xqy, де x, y&#8714;T*, q&#8714;Q. Неформально це означає, що на стрiчцi записане слово xy, тобто злiва i справа вiд xy можуть стояти тiльки символи 	&#955;, МТ
         знаходиться в станi q, голiвка читає 1-й символ пiдслова y. Конфiгурацiю вигляду q<sub>0</sub>x, де 1-й та останнiй символи слова x вiдмiннi вiд 	&#955;, назвемо початковою.  Конфiгурацiю вигляду xq*y назвемо фiнальною. </p>
    </div>
  );
};

export default MachineTuring;
